shyamnexus/CAN_HMI/Example/ESP-IDF/09_CAN_Thermocouple_HMI/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y

# LCD RGB Bounce buffer height
CONFIG_EXAMPLE_LCD_RGB_BOUNCE_BUFFER_HEIGHT=10

# LVGL configuration
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_MODE=3
CONFIG_EXAMPLE_LVGL_PORT_ROTATION_DEGREE=0
CONFIG_EXAMPLE_LVGL_PORT_BUF_PSRAM=y
CONFIG_EXAMPLE_LVGL_PORT_BUF_HEIGHT=100
CONFIG_EXAMPLE_LVGL_PORT_TICK=5
CONFIG_EXAMPLE_LVGL_PORT_TASK_MAX_DELAY_MS=500
CONFIG_EXAMPLE_LVGL_PORT_TASK_MIN_DELAY_MS=1
CONFIG_EXAMPLE_LVGL_PORT_TASK_STACK_SIZE_KB=6
CONFIG_EXAMPLE_LVGL_PORT_TASK_PRIORITY=4
CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1

# CAN/TWAI Configuration
CONFIG_EXAMPLE_TX_GPIO_NUM=20
CONFIG_EXAMPLE_RX_GPIO_NUM=19
CONFIG_EXAMPLE_CAN_BITRATE=500
CONFIG_EXAMPLE_CAN_BASE_ID=0x100

# Thermocouple Configuration
CONFIG_EXAMPLE_USE_SIMULATED_DATA=y
CONFIG_EXAMPLE_SIMULATION_UPDATE_MS=1000
CONFIG_EXAMPLE_NUM_THERMOCOUPLE_CHANNELS=16
